{"format": "graph-model", "generatedBy": "2.11.0", "convertedBy": "TensorFlow.js Converter v4.2.0", "signature": {"inputs": {"t_X": {"name": "t_x:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}]}}}}, "modelTopology": {"node": [{"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "t_x", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "100"}]}}}}, {"name": "PartitionedCall/PartitionedCall/Mul", "op": "Mul", "input": ["unknown", "t_x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/PartitionedCall/Add", "op": "AddV2", "input": ["PartitionedCall/PartitionedCall/Mul", "unknown_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/PartitionedCall/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1286}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "unknown", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}, {"name": "unknown_0", "shape": [], "dtype": "float32", "quantization": {"dtype": "float16", "original_dtype": "float32"}}]}]}