{
  "format": "graph-model",
  "generatedBy": "2.11.0",
  "convertedBy": "TensorFlow.js Converter v4.2.0",
  "signature": {
    "inputs": {
      "t_X": {
        "name": "t_x:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "100" }] }
      }
    },
    "outputs": {
      "output_0": {
        "name": "Identity:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "100" }] }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "StatefulPartitionedCall/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/ReadVariableOp_1",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "t_x",
        "op": "Placeholder",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "shape": { "shape": { "dim": [{ "size": "100" }] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/PartitionedCall/Mul",
        "op": "Mul",
        "input": ["StatefulPartitionedCall/ReadVariableOp", "t_x"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/PartitionedCall/Add",
        "op": "AddV2",
        "input": [
          "StatefulPartitionedCall/PartitionedCall/Mul",
          "StatefulPartitionedCall/ReadVariableOp_1"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "Identity",
        "op": "Identity",
        "input": ["StatefulPartitionedCall/PartitionedCall/Add"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      }
    ],
    "library": {},
    "versions": { "producer": 1286 }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "StatefulPartitionedCall/ReadVariableOp",
          "shape": [],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint16",
            "min": 1.0250924825668335,
            "scale": 1.0,
            "original_dtype": "float32"
          }
        },
        {
          "name": "StatefulPartitionedCall/ReadVariableOp_1",
          "shape": [],
          "dtype": "float32",
          "quantization": {
            "dtype": "uint16",
            "min": -0.1714038997888565,
            "scale": 1.0,
            "original_dtype": "float32"
          }
        }
      ]
    }
  ]
}
