{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v4.2.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_9", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "rescaling_11_input"}}, {"class_name": "Rescaling", "config": {"name": "rescaling_11", "trainable": true, "dtype": "float32", "scale": 0.00392156862745098, "offset": 0.0}}, {"class_name": "KerasLayer", "config": {"name": "keras_layer_2", "trainable": false, "dtype": "float32", "handle": "./saved_models/insect", "signature": "default", "output_key": "default"}}]}}}, "weightsManifest": [{"paths": [], "weights": []}]}